In [3]:
# импортируем numpy и pandas
import numpy as np
import pandas as pd

# импортируем datetime
import datetime
from datetime import datetime, date

kino = pd.read_csv("Data/new_year_film.csv", index_col='name')
kino.head()

                             country  time ranking   type  year       director
name
Невеста                       Россия    74    7,66  фильм  2006  Билли Уайлдер
Кто приходит в зимний вечер   Россия    90   6,038  фильм  2006  Билли Уайлдер
Моя мама Снегурочка           Россия    90   6,828  фильм  2007  Билли Уайлдер
Набережная Орфевр            Франция   106   7,597  фильм  1947  Билли Уайлдер
Лузер                         Россия   104   6,065  фильм  2007  Билли Уайлдер

### Переименование столбцов

Полезно, когда хотим убрать пробелы из названий столбцов.

Программный код возращает копию датафрейма с переименованным столбцом.

In [7]:
kino_rename = kino.rename(columns={'time': 'time_film'})
kino_rename[:2]

,country,time_film,ranking,type,year,director
name,,,,,,
Невеста,Россия,74,"7,66",фильм,2006,Билли Уайлдер
Кто приходит в зимний вечер,Россия,90,"6,038",фильм,2006,Билли Уайлдер

In [8]:
kino.rename(columns=                  
           {'time': 'time_film'},                   
           inplace=True)  # переименовывает столбец на месте
kino.columns

Index(['country', 'time_film', 'ranking', 'type', 'year', 'director'], dtype='object')

### Добавление новых столбцов с помощью оператора [] и метода .insert()

In [9]:
kino_copy = kino.copy()

In [ ]:
# добавляем столбец
kino_copy['rounded_ranking'] = kino.ranking.round()
kino_copy[:2]

In [ ]:
kino_copy = kino.copy()
# вставляем столбец RoundedPrice в качестве второго столбца датафрейма
kino_copy.insert(1, 'rounded_ranking', sp500.ranking.round())
kino_copy[:2]

### Добавление столбцов за счет расширения датафрейма

In [8]:
kino_copy = kino[:3].copy()

In [11]:
kino_copy.loc[:,'imdb'] = 0 # добавляем столбец с нулевыми значениями
kino_copy

,country,time_film,ranking,type,year,director,imdb
name,,,,,,,
Невеста,Россия,74,"7,66",фильм,2006,Билли Уайлдер,0
Кто приходит в зимний вечер,Россия,90,"6,038",фильм,2006,Билли Уайлдер,0
Моя мама Снегурочка,Россия,90,"6,828",фильм,2007,Билли Уайлдер,0
Набережная Орфевр,Франция,106,"7,597",фильм,1947,Билли Уайлдер,0
Лузер,Россия,104,"6,065",фильм,2007,Билли Уайлдер,0
...,...,...,...,...,...,...,...
Карнавальная ночь,СССР,78,"7,929",фильм,1956,NaN,0
Квартира,США,125,"8,021",фильм,1960,NaN,0
Когда зажигаются елки,СССР,20,"7,94",мультфильм,1950,NaN,0
Кошмар перед Рождеством,США,76,"8,049",мультфильм,1993,NaN,0
Красавица и чудовище: Чудесное Рождество (видео),США,72,"6,814",мультфильм,1997,NaN,0

In [12]:
kino_copy = kino[:3].copy()

In [14]:
# добавляем новый столбец со случайно сгенерированными значениями
kino_copy.loc[:,'imdb'] = pd.Series(np.random.randint(1, 10), index=kino_copy.index)
kino_copy

,country,time_film,ranking,type,year,director,imdb
name,,,,,,,
Невеста,Россия,74,"7,66",фильм,2006,Билли Уайлдер,6
Кто приходит в зимний вечер,Россия,90,"6,038",фильм,2006,Билли Уайлдер,6
Моя мама Снегурочка,Россия,90,"6,828",фильм,2007,Билли Уайлдер,6

### Добавление столбцов с помощью конкатенации

In [10]:
# создаем объект DataFrame с единственным столбцом RoundedPrice
rounded_price = pd.DataFrame({'RoundedPrice': sp500.Price.round()})

# конкатенируем по оси столбцов
concatenated = pd.concat([sp500, rounded_price], axis=1)
concatenated[:5]

,Sector,Price,BookValue,RoundedPrice
Symbol,,,,
MMM,Industrials,141.14,26.668,141.0
ABT,Health Care,39.60,15.573,40.0
ABBV,Health Care,53.95,2.954,54.0
ACN,Information Technology,79.79,8.326,80.0
ACE,Financials,102.91,86.897,103.0

In [11]:
# создаем объект DataFrame с единственным 
# столбцом Price
rounded_price = pd.DataFrame({'Price': sp500.Price.round()})
rounded_price[:5]

        Price
Symbol
MMM     141.0
ABT      40.0
ABBV     54.0
ACN      80.0
ACE     103.0

In [12]:
# в результате получаем два столбца Price
dups = pd.concat([sp500, rounded_price], axis=1)
dups[:5]

                        Sector   Price  BookValue  Price
Symbol
MMM                Industrials  141.14     26.668  141.0
ABT                Health Care   39.60     15.573   40.0
ABBV               Health Care   53.95      2.954   54.0
ACN     Information Technology   79.79      8.326   80.0
ACE                 Financials  102.91     86.897  103.0

In [13]:
# извлекаем оба столбца Price
dups.Price[:5]

         Price  Price
Symbol
MMM     141.14  141.0
ABT      39.60   40.0
ABBV     53.95   54.0
ACN      79.79   80.0
ACE     102.91  103.0

### Переупорядочивание столбцов

In [14]:
# возвращаем новый объект DataFrame со столбцами,
# расположенными в обратном порядке
reversed_column_names = sp500.columns[::-1]
sp500[reversed_column_names][:5]

        BookValue   Price                  Sector
Symbol
MMM        26.668  141.14             Industrials
ABT        15.573   39.60             Health Care
ABBV        2.954   53.95             Health Care
ACN         8.326   79.79  Information Technology
ACE        86.897  102.91              Financials

### Замена содержимого столбца

In [15]:
# операция выполняется на месте, поэтому создадим копию
copy = sp500.copy()
# заменяем данные в столбце Price новыми значениями
# вместо добавления нового столбца
copy.Price = rounded_price.Price
copy[:5]

                        Sector  Price  BookValue
Symbol
MMM                Industrials  141.0     26.668
ABT                Health Care   40.0     15.573
ABBV               Health Care   54.0      2.954
ACN     Information Technology   80.0      8.326
ACE                 Financials  103.0     86.897

In [16]:
# операция выполняется на месте, поэтому создадим копию
copy = sp500.copy()
# заменяем данные в столбце Price округленными значениями
copy.loc[:,'Price'] = rounded_price.Price
copy[:5]

                        Sector  Price  BookValue
Symbol
MMM                Industrials  141.0     26.668
ABT                Health Care   40.0     15.573
ABBV               Health Care   54.0      2.954
ACN     Information Technology   80.0      8.326
ACE                 Financials  103.0     86.897

### Удаление столбцов

In [17]:
# пример использования del для удаления столбца
# делаем копию, потому что операция выполняется на месте
copy = sp500.copy()
del copy['BookValue']
copy[:2]

             Sector   Price
Symbol
MMM     Industrials  141.14
ABT     Health Care   39.60

In [18]:
# пример использования pop для удаления столбца из датафрейма
# делаем копию, потому что операция выполняется на месте
copy = sp500.copy()
# эта строка удалит столбец Sector и возвратит его как серию
popped = copy.pop('Sector')
# столбец Sector удален на месте
copy[:2]

         Price  BookValue
Symbol
MMM     141.14     26.668
ABT      39.60     15.573

In [19]:
# и у нас есть столбец Sector, полученный
# в результате применения pop
popped[:5]

Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials
Name: Sector, dtype: object

In [20]:
# пример использования drop для удаления столбца из датафрейма
# делаем копию
copy = sp500.copy()
# эта строка вернет новый датафрейм с удаленным столбцом 'Sector’
# копия датафрейма не изменится
afterdrop = copy.drop(['Sector'], axis = 1)
afterdrop[:5]

         Price  BookValue
Symbol
MMM     141.14     26.668
ABT      39.60     15.573
ABBV     53.95      2.954
ACN      79.79      8.326
ACE     102.91     86.897

### Присоединение строк из других объектов DataFrame с помощью метода .append()

In [21]:
# копируем первые три строки датафрейма sp500
df1 = sp500.iloc[0:3].copy()
# копируем строки в позициях 10, 11 и 2
df2 = sp500.iloc[[10, 11, 2]]
# присоединяем к датафрейму df1 датафрейм df2
appended = df1.append(df2)
# в результате к строкам первого датафрейма
# будут присоединены строки второго датафрейма
appended

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954
A       Health Care   56.18     16.928
GAS       Utilities   52.98     32.462
ABBV    Health Care   53.95      2.954

In [22]:
# датафрейм df3 использует индекс датафрейма df1 
# и у него один столбец PER
# кроме того, это еще и хороший пример 
# использования скалярного значения
# для инициализации нескольких строк
df3 = pd.DataFrame(0.0, 
                   index=df1.index,
                   columns=['PER'])
df3

        PER
Symbol
MMM     0.0
ABT     0.0
ABBV    0.0

In [36]:
# присоединяем к датафрейму df1 датафрейм df3
# каждый датафрейм содержит по три строки, таким 
# образом в итоге получим шесть строк
# df1 не имеет столбца PER, таким образом для строк df1, вошедших 
# в итоговый датафрейм, в столбце PER будут получены значения NaN
# df3 не имеет столбцов BookValue, Price и Sector, таким образом для 
# строк df3, вошедших в итоговый датафрейм, в столбцах BookValue, Price 
# и Sector также будут получены значения NaN
df1.append(df3, sort=False)

             Sector   Price  BookValue  PER
Symbol
MMM     Industrials  141.14     26.668  NaN
ABT     Health Care   39.60     15.573  NaN
ABBV    Health Care   53.95      2.954  NaN
MMM             NaN     NaN        NaN  0.0
ABT             NaN     NaN        NaN  0.0
ABBV            NaN     NaN        NaN  0.0

In [24]:
# игнорируем метки индекса, создаем индекс по умолчанию
df1.append(df3, ignore_index=True)

   BookValue  PER   Price       Sector
0     26.668  NaN  141.14  Industrials
1     15.573  NaN   39.60  Health Care
2      2.954  NaN   53.95  Health Care
3        NaN  0.0     NaN          NaN
4        NaN  0.0     NaN          NaN
5        NaN  0.0     NaN          NaN

### Конкатенация строк

In [25]:
# копируем первые три строки датафрейма sp500
df1 = sp500.iloc[0:3].copy()
# копируем строки в позициях 10, 11 и 2
df2 = sp500.iloc[[10, 11, 2]]
# передаем их в виде списка
pd.concat([df1, df2])

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954
A       Health Care   56.18     16.928
GAS       Utilities   52.98     32.462
ABBV    Health Care   53.95      2.954

In [26]:
# копируем df2
df2_2 = df2.copy()
# добавляем в df2_2 столбец, которого нет в df1
df2_2.insert(3, 'Foo', pd.Series(0, index=df2.index))
# смотрим df2_2
df2_2

             Sector  Price  BookValue  Foo
Symbol
A       Health Care  56.18     16.928    0
GAS       Utilities  52.98     32.462    0
ABBV    Health Care  53.95      2.954    0

In [37]:
# теперь конкатенируем
pd.concat([df1, df2_2], sort=False)

             Sector   Price  BookValue  Foo
Symbol
MMM     Industrials  141.14     26.668  NaN
ABT     Health Care   39.60     15.573  NaN
ABBV    Health Care   53.95      2.954  NaN
A       Health Care   56.18     16.928  0.0
GAS       Utilities   52.98     32.462  0.0
ABBV    Health Care   53.95      2.954  0.0

In [38]:
# задаем ключи
r = pd.concat([df1, df2_2], keys=['df1', 'df2'], sort=False)
r

                 Sector   Price  BookValue  Foo
    Symbol
df1 MMM     Industrials  141.14     26.668  NaN
    ABT     Health Care   39.60     15.573  NaN
    ABBV    Health Care   53.95      2.954  NaN
df2 A       Health Care   56.18     16.928  0.0
    GAS       Utilities   52.98     32.462  0.0
    ABBV    Health Care   53.95      2.954  0.0

### Добавление и замена строк за счет расширения датафрейма

In [29]:
# создаем срез датафрейма sp500 и копируем его 
ss = sp500[:3].copy()
# создаем новую строку с меткой индекса FOO
# и присваиваем столбцам некоторые значения 
# с помощью списка
ss.loc['FOO'] = ['the sector', 100, 110]
ss

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954
FOO      the sector  100.00    110.000

### Удаление строк с помощью метода .drop()

In [30]:
# получаем копию первых 5 строк датафрейма sp500
ss = sp500[:5]
ss

                        Sector   Price  BookValue
Symbol
MMM                Industrials  141.14     26.668
ABT                Health Care   39.60     15.573
ABBV               Health Care   53.95      2.954
ACN     Information Technology   79.79      8.326
ACE                 Financials  102.91     86.897

In [31]:
# удаляем строки с метками ABT и ACN
afterdrop = ss.drop(['ABT', 'ACN'])
afterdrop[:5]

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABBV    Health Care   53.95      2.954
ACE      Financials  102.91     86.897

### Удаление строк с помощью логического отбора

In [32]:
# определяем строки, в которых Price > 300
selection = sp500.Price > 300
# выводим информацию о количестве строк и 
# количестве строк, которые будут удалены
(len(selection), selection.sum())

(500, 10)

In [33]:
# для отбора применим побитовое отрицание
# к выражению selection
price_less_than_300 = sp500[~selection]
price_less_than_300

                        Sector   Price  BookValue
Symbol
MMM                Industrials  141.14     26.668
ABT                Health Care   39.60     15.573
ABBV               Health Care   53.95      2.954
ACN     Information Technology   79.79      8.326
ACE                 Financials  102.91     86.897
...                        ...     ...        ...
YHOO    Information Technology   35.02     12.768
YUM     Consumer Discretionary   74.77      5.147
ZMH                Health Care  101.84     37.181
ZION                Financials   28.43     30.191
ZTS                Health Care   30.53      2.150

[490 rows x 3 columns]

### Удаление строк с помощью среза

In [34]:
# отбираем лишь первые три строки
only_first_three = sp500[:3]
only_first_three

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954

In [35]:
# отбираем лишь первые три строки,
# но теперь копируем их
only_first_three = sp500[:3].copy()
only_first_three

             Sector   Price  BookValue
Symbol
MMM     Industrials  141.14     26.668
ABT     Health Care   39.60     15.573
ABBV    Health Care   53.95      2.954